token= "457605966:AAFuPta5AL5PS3cDeB_tv6-j1vNSBB012zQ"
botan_key = "ced7eedf-3482-4f6a-bc62-1cba635cdbd4"

def decTry(func):
	def wrap(*arg,**kwarg):
		try:
			func(*arg,**kwarg)
		except Exception:
			pass
	return wrap
dObl={'Днепропетровская':('c. Богуслав',"Павлоград"),
             "Донецкая": ("Бахмут","Волноваха","Горняк","пгт Заречное (пгт Кировск)","Константиновка","Краматорск","с. Красная поляна","Покровск (Красноармейск)","Красный лиман","Курахово",
                          "Мариуполь","пгт Новотроицкое","п. Ольгинка","с. Райгородок","Святогорск","Селидово","Сергеевка","Славянск","с.Старомлиновка","Черкасское"),
             "Запорожская":("Васильевка","Запорожье","Мелитополь","Токмак"),
                "Луганская":('Лисичанск',"пгт Новоайдар","пгт Новопсков","с. Передельское","Северодонецк")}
dCity={'c. Богуслав':2,'Павлоград':3,'Бахмут':5,'Волноваха':6,"Горняк":7,"пгт Заречное (пгт Кировск)":8,"Константиновка":9,"Краматорск":10,"с. Красная поляна":11,
               "Покровск (Красноармейск)":12,"Красный лиман":13,"Курахово":14,"Мариуполь":15,"пгт Новотроицкое":16,"п. Ольгинка":18,"с. Райгородок":19,"Святогорск":20,"Селидово":21,
               "Сергеевка":22,"Славянск":23,"с.Старомлиновка":24,"Черкасское":25,"Васильевка":27,"Запорожье":28,"Мелитополь":29,"Токмак":30,
               'Лисичанск':32,"пгт Новоайдар":33,"пгт Новопсков":34,"с. Передельское":35,"Северодонецк":36}